
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ДокументКассовыйОрдерКлиентСервер.ПроверитьСоответствиеВалютыСчетаПередЗаписью(ЭтаФорма, Отказ);
КонецПроцедуры

&НаСервере
Процедура ОснованиеПриИзмененииНаСервере()
	ДокументКассовыйОрдерСервер.ОснованиеПриИзменении(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ОснованиеПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчетОрганизацииПриИзменении(Элемент)
	ДокументКассовыйОрдерКлиентСервер.СчетОрганизацииПриИзмененииВС(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ДокументКассовыйОрдерКлиентСервер.СуммаПриИзменении(Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументКассовыйОрдерКлиентСервер.СчетОрганизацииПриИзмененииВС(ЭтаФорма);
КонецПроцедуры




