
Процедура ПроверитьСоответствиеВалютыСчетаПередЗаписью(Форма, Отказ) Экспорт
	Если Форма.Объект.Валюта <> Форма.ВалютаСчета Тогда
		СервисКлиентСервер.СообщитьПользователю("Валюта счета не соответствует валюте в документе.", "ВалютаСчета");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры

// Процедура - Счет списания при изменении
// Обновляет поле "Валюта счета" данными из нового значения счета организации.
// Осуществляет обращение к серверу для получения валюты счета.
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Форма документов финансовых поераций расход/списание и приход/поступление. 
Процедура СчетОрганизацииПриИзмененииВС(Форма) Экспорт
	Форма.ВалютаСчета = СправочникВызовСервера.ПолучитьВалютуСчетаОрганизации(Форма.Объект.СчетОрганизации);
КонецПроцедуры

Процедура СуммаПриИзменении(Объект) Экспорт
	Если Объект.Сумма > Объект.СуммаКОплате Тогда
		Объект.Сумма = Объект.СуммаКОплате;
	КонецЕсли;
КонецПроцедуры