
#Область События 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДокументЗакупкиПродажиКлиентСервер.ПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	ДокументЗакупкиПродажиКлиентСервер.ВидЦеныПриИзменении(ЭтаФорма);
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ДокументЗакупкиПродажиКлиентСервер.ТоварыНоменклатураПриИзменении(ЭтаФорма); 
КонецПроцедуры

// При изменении цены или количества
&НаКлиенте
Процедура ТоварыРасчитатьСтоимость(Элемент)
	ДокументЗакупкиПродажиКлиентСервер.ТоварыРасчитатьСтоимость(ЭтаФорма);
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	ДокументЗакупкиПродажиКлиентСервер.ТоварыПослеУдаления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ДокументЗакупкиПродажиКлиентСервер.ВалютаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение);
КонецПроцедуры 

#КонецОбласти 

#Область Команды

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ДокументЗакупкиПродажиКлиентСервер.ОбновитьЦены(ЭтаФорма);
КонецПроцедуры

#КонецОбласти  
