Функция ВыбратьТекстМеждуРусскимИАльтернативным(РусскийТчкЗптАльтернативный)
	ВариантыТекста = СтрРазделить(РусскийТчкЗптАльтернативный, ";");
	Если ВариантыТекста.Количество()>1 Тогда
		Возврат ?(ТекущийЯзык() = "ru", ВариантыТекста[0], ВариантыТекста[1]);
		//Возврат НСтр("ru = '"+РазделеннаяСтрока[0]+"'; en = '"+РазделеннаяСтрока[1]+"'");
	КонецЕсли;
	Возврат РусскийТчкЗптАльтернативный;
КонецФункции 
 
// <Описание функции>
// Открывает диалоговое окно для выбора файла.
// Параметры:
//  Режим  - РежимДиалогаВыбораФайла - Режим диалога.
//  Заголовок  - Строка - Заголовок окна. Через символ ";" можно указать заголовок на английском.
//  ИмяФильтра - Строка - Название фильтра формата файла. Через символ ";" можно указать название на английском.
//  ФорматФайлов - Строка - Формат(ы) файла(ов) для фильтра, перечесление задается через символ ";", пример: "*.txt;...;*.jpg".
//  НачальныйПуть - Строка - Содержит начальное полное имя файла.
//  Успех - Булево - Является флагом успешности выбора.
// Возвращаемое значение:
//  Строка   - Полный путь к выбраному файлу.
Функция ДиалоговоеОкно(Режим, Заголовок, ИмяФильтра, ФорматФайлов, НачальныйПуть, Успех)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = ВыбратьТекстМеждуРусскимИАльтернативным(Заголовок); 
	ДиалогОткрытияФайла.Фильтр = ВыбратьТекстМеждуРусскимИАльтернативным(ИмяФильтра) + "("+ФорматФайлов+")|"+ФорматФайлов;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	Если Режим = РежимДиалогаВыбораФайла.Открытие Или РежимДиалогаВыбораФайла.Сохранение Тогда			
		ДиалогОткрытияФайла.ПолноеИмяФайла = НачальныйПуть;
		Успех = ДиалогОткрытияФайла.Выбрать();
		Если Успех Тогда
			Возврат ДиалогОткрытияФайла.ПолноеИмяФайла;
		Иначе
			Предупреждение(НСтр("ru = 'Файл не выбран!'; en = 'File not selected!'"));
		КонецЕсли;	
	ИначеЕсли Режим = РежимДиалогаВыбораФайла.ВыборКаталога Тогда			
		ДиалогОткрытияФайла.Каталог = НачальныйПуть;
		Успех = ДиалогОткрытияФайла.Выбрать();
		Если Успех Тогда
			Возврат ДиалогОткрытияФайла.Каталог;
		Иначе
			Предупреждение(НСтр("ru = 'Каталог не выбран!'; en = 'Directory not selected!'"));
		КонецЕсли;
	КонецЕсли; 
	Возврат "";
КонецФункции // ДиалогВыбораФайла()
 

// <Описание функции>
// Открывает диалоговое окно для выбора файла.
// Параметры:
//  ИмяФильтра - Строка - Название фильтра формата файла. Через символ ";" можно указать название на английском.
//  ФорматФайлов - Строка - Формат(ы) файла(ов) для фильтра, перечесление задается через символ ";", пример: "*.txt;...;*.jpg".
//  НачальноеИмяФайла - Строка - Содержит начальное полное имя файла.
//  УспешныйВыбор - Булево - Является флагом успешности выбора.
// Возвращаемое значение:
//  Строка   - Полный путь к выбраному файлу.
Функция ВыбратьФайл(ИмяФильтра, ФорматФайлов, НачальноеИмяФайла="", УспешныйВыбор=Ложь) Экспорт 
	Возврат ДиалоговоеОкно(РежимДиалогаВыбораФайла.Открытие, "Выбрать", ИмяФильтра, ФорматФайлов, НачальноеИмяФайла, УспешныйВыбор);
КонецФункции // ВыбратьФайл()

// <Описание функции>
// Открывает диалоговое окно для выбора папки.
// Параметры:
//  НачальныйПуть - Строка - Содержит начальное полное имя папки.
//  УспешныйВыбор - Булево - Является флагом успешности выбора.
// Возвращаемое значение:
//  Строка   - Полный путь к выбраной папки.
Функция ВыбратьПапку(НачальныйПуть="", УспешныйВыбор=Ложь) Экспорт
	Возврат ДиалоговоеОкно(РежимДиалогаВыбораФайла.ВыборКаталога, "Выбрать папку", "", "", НачальныйПуть, УспешныйВыбор);
КонецФункции // ВыбратьФайл()

// <Описание функции>
// Открывает диалоговое окно выбора файла для сохранения.
// Параметры:
//  ИмяФильтра - Строка - Название фильтра формата файла. Через символ ";" можно указать название на английском.
//  ФорматФайлов - Строка - Формат(ы) файла(ов) для фильтра, перечесление задается через символ ";", пример: "*.txt;...;*.jpg".
//  НачальноеИмяФайла - Строка - Содержит начальное полное имя файла.
//  УспешныйВыбор - Булево - Является флагом успешности выбора.
// Возвращаемое значение:
//  Строка   - Полный путь к выбраному файлу.
Функция ВыбратьФайлСохранения(ИмяФильтра, ФорматФайлов, НачальноеИмяФайла="", УспешныйВыбор=Ложь) Экспорт 
	Возврат ДиалоговоеОкно(РежимДиалогаВыбораФайла.Сохранение, "Выбрать", ИмяФильтра, ФорматФайлов, НачальноеИмяФайла, УспешныйВыбор);
КонецФункции // ВыбратьФайлСохранения()
