
&НаКлиенте
Процедура СписокВалютыВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекСтрокаСписка = Элементы.СписокВалюты.ТекущиеДанные;
	Для каждого СтрокаСВ Из Объект.СписокВалют Цикл
		Если СтрокаСВ <> ТекСтрокаСписка И СтрокаСВ.Валюта = ВыбранноеЗначение Тогда
			СервисКлиентСервер.СообщитьПользователю(
				"Валюта """+СтрокаСВ.Валюта+""" уже есть в списке.",
				"Объект.СписокВалют["+(СтрокаСВ.НомерСтроки-1)+"].Валюта"
			);
			СтандартнаяОбработка = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Валюты = Справочники.Валюты.Выбрать();
	СписокВ = Объект.СписокВалют;
	ИндГраница = СписокВ.Количество()-1;
	Пока Валюты.Следующий() Цикл
		Добавить = Истина;
		Для ИндСтроки = 0 По ИндГраница Цикл
			Если СписокВ[ИндСтроки].Валюта = Валюты.Ссылка Тогда
				Добавить = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Добавить Тогда
			СтрокаСВ = СписокВ.Добавить();
			СтрокаСВ.Валюта = Валюты.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
