
Процедура СообщитьПользователю(Текст, Поле = Неопределено) Экспорт 
	Если ЗначениеЗаполнено(Поле) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Текст;
		Сообщение.Поле = Поле;
		Сообщение.Сообщить();		
	Иначе 	
		Сообщить(Текст);		
	КонецЕсли;
КонецПроцедуры // Сообщить()

// Функция - Поля формы заполнены
// Проверяет заполнения указанных полей.
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - Форма поля которой будут проверяться.
//  Поля	 - Строка - Строка с именами полей разделенных символом ";" Пример: "<ИмяРеквизитаФормы>;Объект.<ИмяРеквизита>"
// Возвращаемое значение:
//  Булево - Истина если все поля заполнены, иначе Ложь.
Функция ПоляФормыЗаполнены(Форма, Поля) Экспорт
	НеЗаполнено = Ложь;
	МсПоля = СтрРазделить(Поля, ";");
	Для каждого ИмяПоля Из МсПоля Цикл 
		ПолноеИмя = СтрРазделить(ИмяПоля, ".");
		Если ПолноеИмя.Количество() = 1 Тогда
			Значение = Форма[ИмяПоля];
		Иначе
			Значение = Форма;
			Для каждого ЧастьИмя Из ПолноеИмя Цикл
				Значение = Значение[ЧастьИмя];
			КонецЦикла;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Значение) Тогда
			СообщитьПользователю("Поле не заполнено.", ИмяПоля);			
			НеЗаполнено = Истина;
		КонецЕсли;                 
	КонецЦикла;
	Возврат НеЗаполнено;
КонецФункции // ПоляЗаполнены()

