
&НаКлиенте
Процедура СписокНоменклатурыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекСтрокаСписка = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Для каждого СтрокаСН Из Объект.СписокНоменклатуры Цикл
		Если СтрокаСН <> ТекСтрокаСписка И СтрокаСН.Номенклатура = ВыбранноеЗначение Тогда
			СервисКлиентСервер.СообщитьПользователю(
				"Номенклатура """+СтрокаСН.Номенклатура+""" уже есть в списке.",
				"Объект.СписокНоменклатуры["+(СтрокаСН.НомерСтроки-1)+"].Номенклатура"
			);
			СтандартнаяОбработка = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ГруппаН = ?(ЗначениеЗаполнено(ГруппаНоменклатуры), ГруппаНоменклатуры, Неопределено);
	Номенклатура = Справочники.Номенклатура.Выбрать(ГруппаН);
	СписокН = Объект.СписокНоменклатуры;
	ИндГраница = СписокН.Количество()-1;
	Пока Номенклатура.Следующий() Цикл
		Если Номенклатура.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Добавить = Истина;
		Для ИндСтроки = 0 По ИндГраница Цикл
			Если СписокН[ИндСтроки].Номенклатура = Номенклатура.Ссылка Тогда
				Добавить = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Добавить Тогда
			СтрокаСН = СписокН.Добавить();
			СтрокаСН.Номенклатура = Номенклатура.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
